{
  "_class_name": "ControlnetXsVaeDecoderCogVideoX",
  "_diffusers_version": "0.32.1",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    128,
    128,
    128
  ],
  "down_block_types": [
    "CogVideoXDownBlock3D",
    "CogVideoXDownBlock3D",
    "CogVideoXDownBlock3D",
    "CogVideoXDownBlock3D"
  ],
  "in_channels": 3,
  "latent_channels": 16,
  "layers_per_block": 3,
  "norm_eps": 1e-06,
  "norm_num_groups": 32,
  "sample_height": 480,
  "sample_width": 720,
  "temporal_compression_ratio": 4,
  "up_block_types": [
    "CogVideoXUpBlock3D",
    "CogVideoXUpBlock3D",
    "CogVideoXUpBlock3D",
    "CogVideoXUpBlock3D"
  ],
}
