{
  "_class_name": "CogVideoXTransformer3DControlnetXs",
  "_diffusers_version": "0.32.1",
  "activation_fn": "gelu-approximate",
  "attention_bias": true,
  "attention_head_dim": 128,
  "dropout": 0.0,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 128,
  "max_text_seq_length": 226,
  "norm_elementwise_affine": true,
  "norm_eps": 1e-05,
  "num_attention_heads": 4,
  "num_layers": 12,
  "patch_size": 2,
  "patch_size_t": 2,
  "sample_frames": 81,
  "sample_height": 96,
  "sample_width": 170,
  "spatial_interpolation_scale": 1.875,
  "temporal_compression_ratio": 4,
  "temporal_interpolation_scale": 1.0,
  "text_embed_dim": 4096,
  "time_embed_dim": 256,
  "timestep_activation_fn": "silu",
  "use_learned_positional_embeddings": false,
  "use_rotary_positional_embeddings": true,
  "up_down_layer_start_idx": 6,
  "up_down_layer_end_idx": 39,
  "skip_layer_ratio": 3
}
